Tekla Open API Reference for Tekla Structures 2025
OBB.Extent2 Property
 Gets or sets the extent parallel to Axis2.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Extent2 { get; set; }
Public Property Extent2 As Double
	Get
	Set
Property Value
Type: Double
Exceptions
Exception | Condition
ArgumentException | Thrown when setting the value fails.
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace